// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// string? inputA = Console.ReadLine();
// if(inputA !=null && inputA.Length == 3)
// {
//     Console.WriteLine(inputA[1]);
// }

// Задача со звездочкой
string? inputA = Console.ReadLine();
if(inputA !=null && inputA.Length >= 2)
{
    Console.WriteLine(inputA[1]);
}